rails/kittens/app/controllers/kittens_controller.rb

  def index
    @kittens = Kitten.all
---
SELECT "kittens".* FROM "kittens"

  def show
    @kitten = Kitten.find(params[:id])
---
SELECT "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]