rails/flight-booker-with-mails/app/controllers/bookings_controller.rb

  def new
    @booking = Booking.new(flight_id: booking_new_params[:id],
                           number_of_passengers: booking_new_params[:number_of_passengers])
    @flight = Flight.find(@booking.flight_id)
---
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

  def create
    @booking = Booking.new(booking_create_params)

    @booking.passengers.each { |passenger| passenger.booking = @booking }

    if @booking.save
---
SELECT "passengers".* FROM "passengers" WHERE "passengers"."booking_id" = ?  [["booking_id", 22]]
INSERT INTO "bookings" ("number_of_passengers", "created_at", "updated_at", "flight_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["number_of_passengers", 3], ["created_at", "2024-03-19 06:11:25.403949"], ["updated_at", "2024-03-19 06:11:25.403949"], ["flight_id", 22]]
INSERT INTO "passengers" ("email", "name", "created_at", "updated_at", "booking_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "qwe@gamil.com"], ["name", "qw"], ["created_at", "2024-03-19 06:11:25.407784"], ["updated_at", "2024-03-19 06:11:25.407784"], ["booking_id", 2]]