rails/flight-booker-with-mails/app/controllers/flights_controller.rb

SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights"
SELECT "flights".* FROM "flights" WHERE (arrival_airport_id = '2' AND departure_airport_id = '9') AND "flights"."start_datetime" BETWEEN ? AND ?  [["start_datetime", "2024-03-06 00:00:00"], ["start_datetime", "2024-03-07"]]
---
    def index
      @flight = Flight.new
      @departure_options = Airport.all.map { |airport| [airport.code, airport.id] }
      @arrival_options = @departure_options

      @start_datetimes = Flight.all.map { |flight| [Date.parse(flight.start_datetime).to_fs(:long), flight.start_datetime]  }

      @flights = params[:flight] ? Flight.where("arrival_airport_id = ? AND departure_airport_id = ?",
                                                params["flight"]["arrival_airport"],
                                                params["flight"]["departure_airport"])
                                          .where(start_datetime:
                                                (Date.parse(params["flight"]["start_datetime"]).midnight..
                                                Date.parse(params["flight"]["start_datetime"])+1.day))