rails/flight-booker/app/controllers/flights_controller.rb

SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights"
---
    def index
      @flight = Flight.new
      @departure_options = Airport.all.map { |airport| [airport.code, airport.id] }
      @arrival_options = @departure_options

      @start_datetimes = Flight.all.map { |flight| [Date.parse(flight.start_datetime).to_fs(:long), flight.start_datetime]  }