rails/members-only/app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @author = current_user ? User.find(@post.user_id).username : "Top secret"
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)

    @post.user_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Example"], ["body", "Example"], ["created_at", "2024-02-18 17:43:04.331990"], ["updated_at", "2024-02-18 17:43:04.331990"], ["user_id", 1]]